name1 = input('Введите наименование товара: ')
price1 = input('Введите цену товара: ')
col1 = input('Ведите цвет товара: ')
quan1 = input('Введите количество едениц товара: ')
art1 = (1, {'наименование': name1, 'цена': price1, 'цвет': col1,
            'ед': quan1})
name2 = input('Введите наименование товара: ')
price2 = input('Введите цену товара: ')
col2 = input('Ведите цвет товара: ')
quan2 = input('Введите количество едениц товара: ')
art2 = (2, {'наименование': name2, 'цена': price2, 'цвет': col2,
            'ед': quan2})
name3 = input('Введите наименование товара: ')
price3 = input('Введите цену товара: ')
col3 = input('Ведите цвет товара: ')
quan3 = input('Введите количество едениц товара: ')
art3 = (3, {'наименование': name3, 'цена': price3, 'цвет': col3,
            'ед': quan3})
name = {'наименования': [art1[1].get('наименование'), art2[1].get('наименование'),
                         art3[1].get('наименование')]}
price = {'цены': [art2[1].get('цена'), art2[1].get('цена'), art3[1].get('цена')]}
color = {'цвета':[art2[1].get('цвет'), art2[1].get('цвет'), art3[1].get('цвет')]}
quan = {'количество':[art2[1].get('ед'), art2[1].get('ед'), art3[1].get('ед')]}
print(name)
print(color)
print(price)
print(quan)